In [1]:
import pandas as pd
import numpy as np

In [4]:
date = pd.read_csv("E://Datasets/orders.csv")
time = pd.read_csv("E://Datasets/messages.csv")

In [5]:
date.head(2)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157

In [7]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

The date and time columns are by deafault objects. So we have to convert them into <br>
date and time object.

In [11]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [10]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Converting to datetime datatype.

In [13]:
date['date'] = pd.to_datetime(date['date'])
date.info()

## Now the date column has changed from object to datetime64.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1. Extract Year.

In [14]:
date['date_year'] = date['date'].dt.year

In [15]:
date.head(2)

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018

#### 2. Extracting month and month name.

In [16]:
date['date_month_no'] = date['date'].dt.month
date['month_name'] = date['date'].dt.month_name()

In [17]:
date.head()

        date  product_id  city_id  orders  date_year  date_month_no month_name
0 2019-12-10        5628       25       3       2019             12   December
1 2018-08-15        3646       14     157       2018              8     August
2 2018-10-23        1859       25       1       2018             10    October
3 2019-08-17        7292       25       1       2019              8     August
4 2019-01-06        4344       25       3       2019              1    January

#### 3. Extracting day , dow and name of the day

In [24]:
date['date_day'] = date['date'].dt.day
date['day_of_the_week'] = date['date'].dt.dayofweek
date['day_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders'],inplace=True)
date.head()

,date,date_year,date_month_no,month_name,date_day,day_of_the_week,day_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

#### 4. is_weekend?

In [25]:
date['is_weekend'] = np.where(date['day_name'].isin(['Sunday','Saturday']),1,0)
date.head()

,date,date_year,date_month_no,month_name,date_day,day_of_the_week,day_name,is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

#### 5. Extract week of theYEAR.

In [34]:
date['week_of_the _year'] = date['date'].dt.weekofyear
date.head()

C:\Users\sarth\AppData\Local\Temp\ipykernel_5968\1559078644.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['week_of_the _year'] = date['date'].dt.weekofyear

,date,date_year,date_month_no,month_name,date_day,day_of_the_week,day_name,is_weekend,week_of_the _year
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

#### 6. Extract Quater.

In [36]:
date['quarter'] = date['date'].dt.quarter
date.head()

,date,date_year,date_month_no,month_name,date_day,day_of_the_week,day_name,is_weekend,week_of_the _year,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

#### 7. Extract Semester.

In [37]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)
date.head()

,date,date_year,date_month_no,month_name,date_day,day_of_the_week,day_name,is_weekend,week_of_the _year,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

In [38]:
## Extract Time elapsed between dates
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2022, 10, 11, 15, 0, 48, 335284)

In [39]:
## difference of time.
today - date['date']

0     1036 days 15:00:48.335284
1     1518 days 15:00:48.335284
2     1449 days 15:00:48.335284
3     1151 days 15:00:48.335284
4     1374 days 15:00:48.335284
                 ...
995   1464 days 15:00:48.335284
996   1405 days 15:00:48.335284
997   1253 days 15:00:48.335284
998   1318 days 15:00:48.335284
999   1092 days 15:00:48.335284
Name: date, Length: 1000, dtype: timedelta64[ns]

In [40]:
## days.
(today - date['date']).dt.days

0      1036
1      1518
2      1449
3      1151
4      1374
       ...
995    1464
996    1405
997    1253
998    1318
999    1092
Name: date, Length: 1000, dtype: int64

In [41]:
## Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0      34.0
1      50.0
2      48.0
3      38.0
4      45.0
       ...
995    48.0
996    46.0
997    41.0
998    43.0
999    36.0
Name: date, Length: 1000, dtype: float64

## Working with time

In [43]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [44]:
## Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [45]:
## Hou, minute ,second
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [47]:
## time part
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [48]:
## time difference in seconds
(today - time['date'])/np.timedelta64(1,'s')

0      2.784318e+08
1      2.666856e+08
2      3.086736e+08
3      2.483658e+08
4      2.826714e+08
           ...
995    3.336414e+08
996    2.749816e+08
997    3.151562e+08
998    3.251788e+08
999    2.622801e+08
Name: date, Length: 1000, dtype: float64

In [49]:
## in minutes
(today - time['date'])/np.timedelta64(1,'m')

0      4.640531e+06
1      4.444761e+06
2      5.144560e+06
3      4.139430e+06
4      4.711190e+06
           ...
995    5.560691e+06
996    4.583027e+06
997    5.252604e+06
998    5.419647e+06
999    4.371336e+06
Name: date, Length: 1000, dtype: float64

In [50]:
## in hours
(today - time['date'])/np.timedelta64(1,'h')

0      77342.180093
1      74079.346760
2      85742.663426
3      68990.496760
4      78519.830093
           ...
995    92678.180093
996    76383.780093
997    87543.396760
998    90327.446760
999    72855.596760
Name: date, Length: 1000, dtype: float64